### Indexado y manejo de archivos CSV

In [17]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\user\anaconda3\lib\site-packages (4.0.0-unsupported)

In [18]:
import pandas as pd
import numpy as np
import pyodbc

In [7]:
ruta = 'data/{}'.format('test.csv')

In [4]:
dict_data = {
    'edad': [10,9,13,14,12,11,12],
    'cm': [115,110,130,155,125,120,125],
    'pais':['co','mx','co','mx','mx','ch','ch'],
    'genero':['M','F','F','M','M','M','F'],
    'Q1':[5,10,8,np.nan,7,8,3],
    'Q2':[7,9,9,8,8,8,9]
}

In [6]:
df = pd.DataFrame(dict_data)
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [8]:
ruta

'data/test.csv'

In [11]:
df.to_csv(ruta, index=False)

In [16]:
df_csv = pd.read_csv(ruta, sep='|')
df_csv

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [14]:
df.to_csv(ruta, sep = '|', index=False)

### Conexi√≥n con bases de datos tipo SQL

In [19]:
driver = '{SQL Server}'
server_name = 'DESKTOP-IG0PCQO\SQLEXPRESS'
db_name = 'AdventureWorksDW2020'
user = 'root'
password = 'root'
sql_conn = pyodbc.connect('''
DRIVER={};SERVER={};DATABASE={};UID={};PWD={};
Trusted_Connection=yes
'''.format(driver, server_name, db_name, user, password))

In [20]:
query_sql = 'Select CustomerKey , FirstName, LastName, BirthDate, Gender, EmailAddress, SpanishEducation, SpanishOccupation from DimCustomer'

In [21]:
df_query = pd.read_sql(query_sql, sql_conn)
df_query.head(5)

,CustomerKey,FirstName,LastName,BirthDate,Gender,EmailAddress,SpanishEducation,SpanishOccupation
0,11000,Jon,Yang,1971-10-06,M,jon24@adventure-works.com,Licenciatura,Profesional
1,11001,Eugene,Huang,1976-05-10,M,eugene10@adventure-works.com,Licenciatura,Profesional
2,11002,Ruben,Torres,1971-02-09,M,ruben35@adventure-works.com,Licenciatura,Profesional
3,11003,Christy,Zhu,1973-08-14,F,christy12@adventure-works.com,Licenciatura,Profesional
4,11004,Elizabeth,Johnson,1979-08-05,F,elizabeth5@adventure-works.com,Licenciatura,Profesional